/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   타일_채우기.cpp                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyeyoo <hyeyoo@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/08/13 14:45:48 by hyeyoo            #+#    #+#             */
/*   Updated: 2020/08/13 14:47:15 by hyeyoo           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>

using namespace std;

int main(void)
{
	int n;
	long *d;

	cin >> n;
	d = new long[30 + 1];

	d[0] = 1;
	d[2] = 3;

	for(int i = 4; i <= 30; i += 2) {
		d[i] = d[i - 2];
		for(int j = 2; j <= i; j += 2) {
			d[i] += (2 * d[i - j]);
		}
	}
	cout << d[n] << endl;
	delete[] d;

}
