/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   02875.cpp                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kylee <kylee@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/04 13:33:04 by kylee             #+#    #+#             */
/*   Updated: 2020/09/04 14:00:48 by kylee            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>

using namespace std;

int main(void)
{
	int n, m, k, t;

	cin >> n >> m >> k;
	// 여학생 짝수 비로 맞추기
	if (n % 2 == 1 && k > 0)
	{
		n -= 1;
		k -= 1;
	}
	else if (n % 2 == 1)
		n -= 1;
	// 2 : 1 비율로 맞추기
	t = 0;
	if (n > 2 * m)
	{
		t = (n - 2 * m);
		n = 2 * m;
	}
	else if (n < 2 * m)
	{
		t = (2 * m - n) / 2;
		m = n / 2;
	}
	// t >= k이면 그대로 출력
	if (t >= k)
	{
		cout << m;
	}
	// t < k 이면 3의 배수마다 자르기
	else
	{
		cout << ((m - ((k - t) + 2) / 3 < 0) ? 0 : m - ((k - t) + 2) / 3);
	}
}
