/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   병든_나이트.cpp                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyeyoo <hyeyoo@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/27 15:43:10 by hyeyoo            #+#    #+#             */
/*   Updated: 2020/09/27 16:43:50 by hyeyoo           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>

using namespace std;

/*
   어떻게 풀지?
   이동 횟수가 4번보다 적다는 건 = 방문한 칸이 5개 미만 무슨 말인가..?
   N이 너무 작으면 어떻게 될까?
   일단 무조건 (+1, +2), (+1, -2)를 반복하면서 움직이는 게 이득인데,
   그게 불가능하면 어떡하지?
*/

int     main(void)
{
    int N, M, ans;
    cin >> N >> M;

    if (N == 1) {
        cout << 1 << endl;
    } else if (N == 2) {
        cout << min((M + 1) / 2, 4) << endl;
    } else {
        if (M >= 7) {
            cout << M - 2 << endl;
        } else {
            cout << min(4, M) << endl;
        }
    }

    return 0;
}
